---
kind: method
id: M:Autodesk.Revit.DB.ExternalFileUtils.GetFileBasedTempFolder(System.String)
source: html/8d3f6e47-0a7c-5043-b479-14f1c6cffc0d.htm
---
# Autodesk.Revit.DB.ExternalFileUtils.GetFileBasedTempFolder Method

Gets a temp folder based on the given file name

## Syntax (C#)
```csharp
public static string GetFileBasedTempFolder(
	string filename
)
```

## Parameters
- **filename** (`System.String`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null